# Exercise

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#Python shortcut for importing files, create string & assign to variable 
path = r'/Users/Chloe/Documents/2. CareerFoundry/2. Data Immersion pt 1/Achievement 4/07-2022 Instacart Basket Analysis'

In [3]:
path

'/Users/Chloe/Documents/2. CareerFoundry/2. Data Immersion pt 1/Achievement 4/07-2022 Instacart Basket Analysis'

In [8]:
#import the orders_products_prior.csv file as df_ords_prior using the os.path.join() function
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

In [9]:
#import the orders_checked.csv file as df_ords using the os.path.join() function
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [10]:
#check the output of df_ords_prior
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
#check the output of df_ords
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,new_customer
0,0,0,2539329,1,prior,1,2,8,NaN,True
1,1,1,2398795,1,prior,2,3,7,15.0,False
2,2,2,473747,1,prior,3,3,12,21.0,False
3,3,3,2254736,1,prior,4,4,7,29.0,False
4,4,4,431534,1,prior,5,4,15,28.0,False

In [17]:
#drop unnecessary columns in df_ords
df_ords = df_ords.drop(columns = ['Unnamed: 0', 'Unnamed: 0.1', 'eval_set'])

In [18]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

In [19]:
#check size
df_ords_prior.shape

(32434489, 4)

In [20]:
#check size
df_ords.shape

(3421083, 7)

In [21]:
#create a new dataframe, df_merged_large, that contains the combined df_ords and df_ords_prior dataframes 
#and uses the “order_id” column as its key. 
#It also includes the indicator = True argument so that you can check for a full match

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [22]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_day_ordered,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [24]:
#Using the value_counts() function lets you quickly sum up all the values in the “_merge” column, 
#letting you see instantly whether you have a full match or not
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [25]:
df_merged_large.shape

(32434489, 11)

In [26]:
#export as pickle file
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))